<template>
    <div>
        <h1>機能について</h1>
        <p>
            購入物が非公開になってしまった時、アイテム情報が見られなくなって悲しくならないように、その時点でのデータを保存する機能です。
        </p>
        <h1>使い方について</h1>
        <p>
            <em
                >この機能は実験的機能のため、今後機能しなくなる可能性もあります。ご了承ください。</em
            >
            <br /><br />
            この機能は、購入時のアイテム情報を取得し、Chrome上で保存しています。
            <br />
            JSON形式での保存であるため、できるだけ保存情報は少なくしていますが、
            <strong
                >重くなる可能性もありますので、いらないアイテムは削除してください。</strong
            >
            <br />
            利用方法は簡単で、アイテムを購入するだけで登録が可能です。追加の操作等は必要ありません。
            <br />
            手動で登録したい場合は、アイテムページの"ツイート"ボタンの隣に配置した、"+データを保存"ボタンを押すことで登録も可能です。
            <br /><br />
            これらのデータは、拡張機能の"オプション"ページから閲覧することができます。
            また、それぞれのアイテムをクリックすると、詳細を確認できます。
            <br />
            アイテムの削除は、このページから行ってください。
        </p>
        <router-link :to="{ name: 'Top' }" class="shop-button">
            アイテム一覧に戻る
        </router-link>
    </div>
</template>

<style scoped>
p {
    font-size: 15px;
}
</style>
